const app = getApp()
Page({
  data: {
    StatusBar: app.globalData.StatusBar,
    CustomBar: app.globalData.CustomBar,
    Custom: app.globalData.Custom,
	more : {
		name : '未婚女性基础检查',
		tag : ['女性专项','关爱女性'],
		location : '佛山市第一医院体检中心',
		warn : '线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。',
		cost : '1223.23',
		know : '线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。线上预约暂不提供发票,此套餐适合未婚或未有性生活史的女性。',
		project : [{
			name : '一般检查',
			content : '一般检查:血压，血压，血压，血压，血压，血压，血压，血压，血压，血压'
		},{
			name : '一般检查2',
			content : '一般检查:血压，血压，血压，血压，血压，血压，血压，血压，血压，血压'
		},{
			name : '一般检查3',
			content : '一般检查:血压，血压，血压，血压，血压，血压，血压，血压，血压，血压'
		},{
			name : '一般检查4',
			content : '一般检查:血压，血压，血压，血压，血压，血压，血压，血压，血压，血压'
		},{
			name : '一般检查5',
			content : '一般检查:血压，血压，血压，血压，血压，血压，血压，血压，血压，血压'
		},{
			name : '一般检查6',
			content : '一般检查:血压，血压，血压，血压，血压，血压，血压，血压，血压，血压'
		},]
	},
	TabCur: 0,
	scrollLeft:0
  },
  onLoad() {
    
  },
  onReady() {
    
  },
  tabSelect(e) {
    this.setData({
      TabCur: e.currentTarget.dataset.id,
      // scrollLeft: (e.currentTarget.dataset.id-1)*60
    })
  }
})