const app = getApp()
Page({
  data: {
    StatusBar: app.globalData.StatusBar,
    CustomBar: app.globalData.CustomBar,
    Custom: app.globalData.Custom,
	information : {
		name : '潘伟健',
		department : '内科',
		title : '内科专家',
		good : '爱好好年阿萨德的',
		introduciton : '来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待来看待'
	}
  },
  onLoad() {
    
  },
  onReady() {
    
  },
})